{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/dense_model_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "150"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "150"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "150"}, {"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "50"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_3_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "100"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/flatten_1/Reshape", "op": "Reshape", "input": ["input_layer", "StatefulPartitionedCall/dense_model_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model_1/flatten_1/Reshape", "StatefulPartitionedCall/dense_model_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/dense_model_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model_1/dense_1/Relu", "StatefulPartitionedCall/dense_model_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/dense_model_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model_1/dense_1_2/Relu", "StatefulPartitionedCall/dense_model_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/dense_model_1/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_3_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/dense_model_1/dense_2_1/Relu", "StatefulPartitionedCall/dense_model_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/dense_model_1/dense_3_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/dense_model_1/dense_3_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/dense_model_1/dense_3_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/dense_model_1/dense_3_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "StatefulPartitionedCall/dense_model_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1/Cast/ReadVariableOp", "shape": [10000, 150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1/BiasAdd/ReadVariableOp", "shape": [150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1_2/Cast/ReadVariableOp", "shape": [150, 150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [150], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_2_1/Cast/ReadVariableOp", "shape": [150, 50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [50], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_3_1/Cast/ReadVariableOp", "shape": [50, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/dense_model_1/dense_3_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}